# Pandas Dataframe

In [1]:
from IPython.display import HTML

In [2]:
import pandas as pd
import numpy as np


sample_data = {'Name': ['Jason Miller', 'Molly Jacobson', 'Tina Milner', 'Jake', 'Amy Schumaker'], 
        'Age': [31, 25, 32, 29, 28], 
        'LanguagesKnown': ["C_Java_C++","Python_C_Java_Spring","C_Spring_C++",
                           "Jason_Java_Node.js","Angular.js_Java_C++_Python"], 
        'Salary': [125000, 94000, 57000, 62100, 70001]}

In [3]:

df = pd.DataFrame(sample_data, columns = ['Name', 'Age', 'LanguagesKnown', 'Salary'])
df

             Name  Age              LanguagesKnown  Salary
0    Jason Miller   31                  C_Java_C++  125000
1  Molly Jacobson   25        Python_C_Java_Spring   94000
2     Tina Milner   32                C_Spring_C++   57000
3            Jake   29          Jason_Java_Node.js   62100
4   Amy Schumaker   28  Angular.js_Java_C++_Python   70001

In [10]:
result = pd.concat([df, df['LanguagesKnown'].str.split('_',expand=True)], axis=1, ignore_index=False )

In [11]:
result

,Name,Age,LanguagesKnown,Salary,0,1,2,3
0,Jason Miller,31,C_Java_C++,125000,C,Java,C++,None
1,Molly Jacobson,25,Python_C_Java_Spring,94000,Python,C,Java,Spring
2,Tina Milner,32,C_Spring_C++,57000,C,Spring,C++,None
3,Jake,29,Jason_Java_Node.js,62100,Jason,Java,Node.js,None
4,Amy Schumaker,28,Angular.js_Java_C++_Python,70001,Angular.js,Java,C++,Python

In [13]:
result.columns

Index(['Name', 'Age', 'LanguagesKnown', 'Salary', 0, 1, 2, 3], dtype='object')

In [14]:
result[0]

0             C
1        Python
2             C
3         Jason
4    Angular.js
Name: 0, dtype: object

In [12]:
print( pd.get_dummies(result[0]) )

   Angular.js  C  Jason  Python
0           0  1      0       0
1           0  0      0       1
2           0  1      0       0
3           0  0      1       0
4           1  0      0       0

In [4]:
dataFrame = df.LanguagesKnown.astype(str).str.get_dummies('_')

In [5]:
dataFrame

   Angular.js  C  C++  Jason  Java  Node.js  Python  Spring
0           0  1    1      0     1        0       0       0
1           0  1    0      0     1        0       1       1
2           0  1    1      0     0        0       0       1
3           0  0    0      1     1        1       0       0
4           1  0    1      0     1        0       1       0

In [6]:
result = pd.concat([df, dataFrame], axis=1, ignore_index=False)

In [7]:
result

,Name,Age,LanguagesKnown,Salary,Angular.js,C,C++,Jason,Java,Node.js,Python,Spring
0,Jason Miller,31,C_Java_C++,125000,0,1,1,0,1,0,0,0
1,Molly Jacobson,25,Python_C_Java_Spring,94000,0,1,0,0,1,0,1,1
2,Tina Milner,32,C_Spring_C++,57000,0,1,1,0,0,0,0,1
3,Jake,29,Jason_Java_Node.js,62100,0,0,0,1,1,1,0,0
4,Amy Schumaker,28,Angular.js_Java_C++_Python,70001,1,0,1,0,1,0,1,0

In [8]:
del result['LanguagesKnown']

In [9]:
result

,Name,Age,Salary,Angular.js,C,C++,Jason,Java,Node.js,Python,Spring
0,Jason Miller,31,125000,0,1,1,0,1,0,0,0
1,Molly Jacobson,25,94000,0,1,0,0,1,0,1,1
2,Tina Milner,32,57000,0,1,1,0,0,0,0,1
3,Jake,29,62100,0,0,0,1,1,1,0,0
4,Amy Schumaker,28,70001,1,0,1,0,1,0,1,0